from datetime import datetime, timedelta

users_of_company =[
    {"name": "John Doe", "birthday": "1985.01.23"},
    {"name": "Jane Smith", "birthday": "1990.01.27"},
    {"name": "Jim Smith", "birthday": "1990.03.07"},
    {"name": "Raw Smith", "birthday": "1990.03.08"},
    {"name": "Jose Smith", "birthday": "1990.03.10"},
]

def get_bd_list(users) -> list:
    current_date = datetime.today().date()
    bd_list = []

    for user in users:
        bd_date_user = datetime.strptime(user["birthday"], "%Y.%m.%d").date()
    
        birthday_this_year = bd_date_user.replace(year=current_date.year)
       
        if birthday_this_year < current_date:
            birthday_this_year = bd_date_user.replace(year=current_date.year + 1)

        if 0 <= (birthday_this_year - current_date).days <= 7:
            congratulation_date = birthday_this_year

            if congratulation_date.weekday() == 5: 
                congratulation_date += timedelta(days=2)
            elif congratulation_date.weekday() == 6:  
                congratulation_date += timedelta(days=1)

         
            bd_list.append({
                "name": user["name"],
                "congratulation_date": congratulation_date.strftime("%Y.%m.%d")
            })

    return bd_list
print(get_bd_list(users_of_company))


#TASK:

# Створюємо дату дня народження в поточному році
# Якщо день народження вже минув у цьому році, переносимо його на наступний рік
# Перевіряємо, чи день народження потрапляє в наступні 7 днів
# Якщо день народження припадає на вихідний (субота або неділя)
        


"""
now = datetime.now()
future_date = now + timedelta(days=10)  # Додаємо 10 днів до поточної дати
print(future_date)
"""

"""
У межах вашої організації, ви відповідаєте за організацію привітань колег з днем народження. 
Щоб оптимізувати цей процес, вам потрібно створити функцію get_bd_list, 
яка допоможе вам визначати, кого з колег потрібно привітати. 
Функція повинна повернути список всіх у кого день народження вперед на 7 днів включаючи поточний день.

У вашому розпорядженні є список users, кожен елемент якого містить інформацію про ім'я користувача 
та його день народження. Оскільки дні народження колег можуть припадати на вихідні, 
ваша функція також повинна враховувати це та переносити дату привітання на 
наступний робочий день, якщо необхідно.



Вимоги до завдання:

Параметр функції users - це список словників, де кожен словник містить ключі name (ім'я користувача, рядок) 
та birthday (день народження, рядок у форматі 'рік.місяць.дата').
Функція має визначати, чиї дні народження випадають вперед на 7 днів включаючи поточний день. 
Якщо день народження припадає на вихідний, дата привітання переноситься на наступний понеділок.
Функція повертає список словників, де кожен словник містить інформацію про користувача (ключ name) 
та дату привітання (ключ congratulation_date, дані якого у форматі рядка 'рік.місяць.дата').


Рекомендації для виконання:

Припускаємо, що ви отримали список users, де кожен словник містить name (ім'я користувача) 
та birthday (дата народження у форматі рядка 'рік.місяць.дата'). 
Ви повинні перетворити дати народження з рядків у об'єкти datetime. 
Конвертуйте дату народження із рядка у datetime об'єкт - datetime.strptime(user["birthday"], "%Y.%m.%d").date(). 
Оскільки потрібна лише дата (без часу), використовуйте .date() для отримання тільки дати.
Визначте поточну дату системи за допомогою datetime.today().date().
Пройдіться по списку users та аналізуйте дати народження кожного користувача (for user in users:).
Перевірте, чи вже минув день народження в цьому році (if birthday_this_year < today). Якщо так, розгляньте дату на наступний рік.
Визначте різницю між днем народження та поточним днем для визначення днів народження на наступний тиждень.
Перевірте, чи день народження припадає на вихідний. Якщо так, перенесіть дату привітання на наступний понеділок.
Створіть структуру даних, яка зберігатиме ім'я користувача та відповідну дату привітання, якщо день народження відбувається протягом наступного тижня.
Виведіть зібрані дані у вигляді списку словників з іменами користувачів та датами привітань.


Критерії оцінювання:

Актуальність та коректність визначення днів народження на 7 днів вперед.
Правильність обробки випадків, коли дні народження припадають на вихідні.
Читабельність та структурованість коду.


Приклад:

Припустимо, у вас є список users:

users = [
    {"name": "John Doe", "birthday": "1985.01.23"},
    {"name": "Jane Smith", "birthday": "1990.01.27"}
]

Використання функції get_bd_list:

bd_list = get_bd_list(users)
print("Список привітань на цьому тижні:", bd_list)

Якщо сьогодні 2024.01.22 результатом може бути:

[
    {'name': 'John Doe', 'congratulation_date': '2024.01.23'}, 
    {'name': 'Jane Smith', 'congratulation_date': '2024.01.29'}
]

Цей список містить інформацію про те, кого і коли потрібно привітати з днем народження.

"""
